{
  "header": {
    "home": "Home",
    "about": "About",
    "portfolio": "Portfolio",
    "testimonials": "Testimonials",
    "contact": "Contact Me"
  },
  "sections": {
    "home": {
      "title": "Hi, I'm Julio",
      "subtitle": "How can I help you?"
    },
    "about": {
      "title": "About me",
      "text1": "I am a Junior Frontend Developer looking for new opportunities. I have developed applications for various companies, where I collaborated in the creation of landing pages, e-commerces and online course websites, which taught me a lot about the value of my work and how it can benefit my clients.",
      "text2": "Currently, I am deepening my knowledge in ReactJS and Typescript. I also have been sharing my knowledge through articles, with published texts about programming and personal development.",
      "link": "Read my articles",
      "alt": "My photo (creator of this website)"
    },
    "portfolio": {
      "title": "Portfolio",
      "subtitle": "Working as an intern and front-end developer, I worked on several projects for different companies. Here is the list below.",
      "description": {
        "courses": {
          "name": "Online courses website",
          "text1": "Online courses and video lessons website, including a blog with posts from students, entirely made in Javascript.",
          "text2": "The application provided students with easy access to content and a harmonious interface."
        },
        "smart-monitor": {
          "name": "Smart Monitor",
          "text1": "Real-time factory machinery management application.",
          "text2": "It facilitates the manager's management and inspection of the machines, offering production statistics."
        },
        "landing": {
          "name": "Landing Page",
          "text1": "Page with questionnaire and purchase sections made in Material UI and using Typeform for forms.",
          "text2": "The application is an excellent presentation of the company, and its questionnaires provide insights for those who fill them out."
        },
        "ecommerce": {
          "name": "E-commerce",
          "text1": "Custom e-commerce website with payment, delivery, and reports sections, made using Typescript and React Hook Forms.",
          "text2": "The project helped automate several previously manual processes."
        },
        "quiz": {
          "name": "Quizz",
          "text1": "Workplace safety quiz with CRUD of questions and answers.",
          "text2": "The questionnaire contributed to ensuring employees' understanding of safety."
        },
        "custom-crud": {
          "name": "Custom Crud Dash",
          "text1": "Package for automating the creation of CRUDs, with tables and forms, using Material UI.",
          "text2": "The package speeds up the creation of new CRUDs and allows high customization."
        }
      },
      "visit": "Visit website"
    },
    "testimonials": {
      "title": "Testimonials",
      "alt": "Photo of ",
      "list": {
        "bruno": {
          "text": "As a Tech Lead, I had the opportunity to work with Julio on several projects. He has always demonstrated excellent technical and creative skills. In addition, Julio has an incredible ability to collaborate with other team members. Commitment and dedication to projects are Julio's strong points. He is extremely reliable, organized and always seeks the best possible outcome for the project. I wholeheartedly recommend him for any Frontend developer position. He will make a great difference in any team he joins.",
          "fullName": "Bruno Chagas",
          "role": "Tech Lead and Full Stack Developer"
        },
        "gustavo": {
          "text": "I strongly recommend Julio as a highly skilled and committed front-end developer. He has exceptional skills in ReactJs, Nexts Js, Material UI, and interface prototyping in Figma, always keeping the user experience in mind. Additionally, Julio is highly communicative and proactive, ensuring that all parties involved in the project are always up-to-date and in sync. Therefore, I strongly recommend Julio as an exceptional front-end developer who will bring great value for your team and projects",
          "fullName": "Gustavo Henrique",
          "role": "Full Stack Developer"
        },
        "ruben": {
          "text": "I had the opportunity to work and learn with Julio during the time we worked together. Julio is a very dedicated and attentive person, a great co-worker who relates very well with others. He always seeks to learn new things and solve problems in the best possible way. I have complete confidence in his efforts to use his front-end development knowledge, as he is a very focused professional who is always seeking to evolve.",
          "fullName": "Ruben Micael",
          "role": "Frontend Developer"
        }
      }
    },
    "contact": {
      "title": "Contact Me",
      "subtitle": "Fill in the fields below to get in contact",
      "fields": {
        "name": {
          "label": "Name",
          "placeholder": "Write your name",
          "errors": {
            "required": "Name is mandatory"
          }
        },
        "email": {
          "label": "E-mail",
          "placeholder": "email@example.com",
          "errors": {
            "email": "E-mail must be a valid email address",
            "required": "E-mail is mandatory"
          }
        },
        "subject": {
          "label": "Subject",
          "placeholder": "Write the subject here",
          "errors": {
            "required": "Subject is mandatory"
          }
        },
        "message": {
          "label": "Message",
          "placeholder": "Write your message here",
          "errors": {
            "required": "Message is mandatory"
          }
        }
      },
      "subjects": {
        "email": "Hello%21",
        "number": "Hello+Julio%21"
      },
      "button": "Send Message",
      "messages": {
        "success": "Email successfully sent",
        "wrong": "Error sending email"
      }
    }
  }
}
